<template>
  <HomePageBase class="page-battle" name="battle"
                :title="{en: 'battle', zh:'联机对战'}">
    <div class="battle-info">
      <ItemCard class="header" number="01" name="Battle" theme="red">关于报名</ItemCard>
      <p>
        参赛报名费 5 RMB / 人，包含参赛名额*1。
        <br />
        报名方式原则上只有预售报名一类。<span class="red">*后详</span>
        <br />
        报名总上限为116人，其中4名为种子训练家。<span class="red">*注1</span>
        <br />
        报名请确保当天能够准时来到现场。
        <br />
        比赛预计为10:00开始，于9:31开始进行登记入场，请训练家尽量9:15前到场。
      </p>
      <ItemCard class="header" number="02" name="Battle" theme="blue">预售报名</ItemCard>
      <p>
        在购买预售票时，除了购买任意种类的门票，同时需要购买对战券。
        <br />
        在收到票后，以【<span class="blue">魔都PMO2021报名+昵称</span>】为邮件名，发送邮件到
        <a class="blue" href="mailto:nebby@getdaze.org">nebby@getdaze.org</a>
      </p>
      <p>
        邮件中需要包含以下内容：
        <br />
        <span class="blue">门票ID号 + 对战券ID号 + 门票、对战券照片 + 个人昵称 + 个人QQ号</span>
        <br />
        以作为报名验证和方便进行后期通知。<span class="red">*注2</span>
      </p>
      <p>
        现场需携带门票在对战登记处排队，事先将队伍放入对战箱，并在登记处通过switch接受大会参赛证，完成后即可得到队伍登记表，同时可得知座位号，并从冠军之路入场。<span class="red">*注3</span>
        <br />
        入场后在指定位置就座，并尽快根据队伍信息填写队伍登记表，填写完后交至就近裁判处，即可等待比赛开始。
      </p>
      <ItemCard class="header" number="03" name="Battle" theme="red">比赛流程</ItemCard>
      <p>分初赛（小组赛）和决赛（淘汰赛），比赛当日会视参赛人数和时间而调整对战场数。</p>
      <h2 class="red">队伍登记表</h2>
      <p>
        训练家必须在参赛前填写队伍登记表的信息。
        <br />
        比赛当天通过NS接受现场大会参赛证进入大会模式后，队伍信息不能更改。
        <br />
        填写表格可以使用中文、日文或英文。
        <br />
        使用中文的场合，请完全使用官方译名。
        <br />
        使用日文或英文的场合，请完整抄写游戏内原文。
      </p>
      <h2 class="red">具体赛制</h2>
      <p>
        采取小组赛+32人淘汰赛赛制<span class="red">*注4</span>
        <br />
        小组赛分成四大组（一击、连击、黑马、白马）
        <br />
        每大组内分8小组（A-H）
        <br />
        每小组2-4人（除H组为种子训练家外）
      </p>
      <h2 class="red">小组赛阶段</h2>
      <p>
        同一小组内训练家在预赛期间互相进行对战，胜场最多的训练家晋级淘汰赛。
        <br />
        小组赛总限时90分钟。若时间内已完成全部对战则提前进入淘汰赛。
        <br />
        在每场对战完成后，请各训练家填写台上预先放好的计分表，在小组赛全部结束后携带小组计分表一同前往各自分区的裁判桌向工作人员通报全部比赛结果，同时确定小组晋级者。
        <br />
        若需要通过队伍重复度来判断晋级者，则将由工作人员进行计算并确定小组晋级者。
      </p>
      <p>
        <span class="red">**小组晋级的判定方式</span>
        <br />
        小组比赛全部结束后，小组内胜场最多者晋级。
        <br />
        若有2位训练家同为胜场最多，则小组赛中互相交战时的胜者晋级。
        <br />
        若有3位训练家同为胜场最多，则3位训练家中队伍重复度<span class="red">*注5</span>最低者晋级。
        <br />
        在3的前提下，若有2位训练家队伍重复度同为最低，则小组赛中互相交战时的胜者晋级。
        <br />
        在3的前提下，若3位训练家队伍重复度相同，则通过抽签决定晋级者。
      </p>
      <h2 class="red">淘汰赛阶段</h2>
      <p>
        小组赛晋级的训练家将按所属小组号为对阵表依据进行淘汰赛。
        <br />
        淘汰赛（决赛和半决赛外）每轮限时30分钟。
        <br />
        每个大组内以AB/CD/EF/GH的顺序组成淘汰赛对阵表。
        <br />
        四强训练家以日月/剑盾的顺序组成半决赛对阵表。
        <br />
        四强开始的半决赛和决赛将进行现场直播。
      </p>
      <ItemCard class="header" number="04" name="Battle" theme="blue">比赛流程</ItemCard>
      <p>总体规则：双打对战-级别对战系列9规则</p>
      <h2 class="blue">队伍构成</h2>
      <p>
        <span class="blue">【可使用的宝可梦】</span>
        <br />
        伽勒尔图鉴No.001～397、铠岛图鉴No.001～210、王冠雪原图鉴No.001～209的宝可梦及以下宝可梦。
      </p>
      <p>
        雷公、炎帝、水君、木守宫、森林蜥蜴、蜥蜴王、火稚鸡、力壮鸡、火焰鸡、水跃鱼、沼跃鱼、巨沼怪、拉帝亚斯、拉帝欧斯、由克希、艾姆利多、亚克诺姆、席多蓝恩、雷吉奇卡斯、克雷色利亚、龙卷云、雷电云、土地云、木木枭、投羽枭、狙射树枭、火斑喵、炎热喵、炽焰咆哮虎、球球海狮、花漾海狮、西狮海壬、卡璞・鸣鸣、卡璞・蝶蝶、卡璞・哞哞、卡璞・鳍鳍、虚吾伊德、爆肌蚊、费洛美螂、电束木、铁火辉夜、纸御剑、恶食大王、毒贝比、四颚针龙、垒磊石、砰头小丑
      </p>
      <p>
        ※参赛对象中有着超极巨化的样子的宝可梦，均可进行超极巨化。
        <br />
        ※只有在《宝可梦 剑／盾》里捉到的宝可梦，从蛋里孵出来的宝可梦，官方赠送的宝可梦及有■对战规则标记的宝可梦才能参赛。
        <br />
        ※详情请参考游戏内详细规则中的“可参加的宝可梦”。
        <br />
        <span class="blue">【总时间】</span>最多15分钟
        <br />
        <span class="blue">【可用时间】</span>最多7分钟
        <br />
        <span class="blue">【决定出场宝可梦的选择时间】</span>90秒
        <br />
        <span class="blue">【每回合的选择时间】</span>45秒
        <br />
        因会使用现场大赛系统，因此本次比赛不支持使用租用队伍。
      </p>
      <h2 class="blue">设备规则</h2>
      <p>
        2.1 游戏系统
        <br />
        训练家可使用任意Nintendo Switch系列主机参赛，训练家有责任准备充足电源，比赛期间因主机电量不足而无法继续作赛者，视为弃权。
        <br />
        2.2 游戏更新
        <br />
        训练家必须确认自己的「精灵宝可梦 剑/盾」游戏版本已更新为最新版本，若训练家于比赛时未能满足游戏版本要求，将有可能受到包括取消资格的处分。（其实也可以早上排队的时候找其他训练家线下共享更新包）
        <br />
        2.3 使用手机规则
        <br />
        训练家可使用手机在进行出战宝可梦选择时拍照记录对方队伍全体，但不可在对战中查阅图鉴软件的资料或是上网查阅各种宝可梦相关资料。
        <br />
        2.4 笔记
        <br />
        训练家于比赛的任何时间都可以进行笔记，惟必须使用白纸或文稿纸；若纸张上印有标志或文字，则无法使用。
        <br />
        现场将提供文稿纸供训练家笔记，有需要的训练家可以在裁判处领取。
        <br />
        2.5 比赛区域内的物品
        <br />
        训练家可摆放幸运符或物件于比赛区域内，但必须保持范围齐整。训练家必须避免摆放妨碍游戏主机红外线通讯的物品。
      </p>
      <h2 class="blue">比赛形式与规则</h2>
      <p>
        3.1 双打对战
        <br />
        每位训练家从对战箱选择4只宝可梦进行对战。比赛开始时，训练家先从队伍中派出2只宝可梦出战。对战场上总共会有4只宝可梦。比赛会持续到其中一方全部4只宝可梦无法战斗或限时结束。
      </p>
      <p>
        3.2 队伍锁定
        <br />
        比赛开始前需将对战精灵存入战斗箱/手持，比赛期间会对训练家进行抽查，若与所填表格不符将从当轮起全部判负。
      </p>
      <p>
        3.3 比赛判决
        <br />
        训练家以令对手最后一只宝可梦无法战斗而获胜。
        <br />
        如果2位训练家的宝可梦在该局最后一回合同时无法战斗，最后无法战斗的宝可梦的训练家将获胜。
      </p>
      <p>
        3.3.1 超时（单场对战）
        <br />
        若单场对战发生超时，则根据游戏内的超时判定决定胜负。具体如下：
        <br />
        <span class="blue">①</span> 超时的是某一方的【可用时间】，则超时方判负
        <br />
        <span class="blue">②</span> 超时的是对战的【总时间】，则根据3.3.3中叙述的各条的优先级判断胜负
      </p>
      <p>
        3.3.2 决胜方法
        <br />
        ▪　初赛：
        <br />
        小组赛采取一局一胜制。
        <br />
        小组赛对战时间最多为90分钟，限时内仍未分出胜负时，将由裁判按座位号顺序开始进行裁决。
        <br />
        仍在进行的对战，将按3.3.3的规则进行判决。
        <br />
        未进行的对战，将按双方队伍重复度进行判决，重复度低的判胜。
        <br />
        ▪　决赛：
        <br />
        淘汰赛采取三局两胜制。
        <br />
        淘汰赛对战时间最多为一轮40分钟，限时内仍未分出胜负时，将由裁判按座位号顺序开始进行裁决。
        <br />
        若达到限时时进行的是1回战，则将按3.3.3的规则进行判决后，直接以该场胜负作为比赛结果，判决胜者的训练家晋级。
        <br />
        若达到限时时进行的是2回战，先按3.3.3的规则进行判决，若判决结果为1回战胜者胜利，则直接判定胜者晋级。若判决结果为1回战败者胜利导致平手时，则将按双方队伍重复度进行判决，重复度低的判胜。
        <br />
        若达到限时时进行的是3回战，则将按3.3.3的规则进行判决，判决胜者的训练家晋级。
      </p>
      <p>
        3.3.3总时间超时时的判定标准
        <br />
        若限时超过时，其中一方训练家仍然未击倒其对手的宝可梦，该局胜利者将会根据下列规则判定。
        <br />
        ・余下的宝可梦
        <br />
        如果其中一方训练家余下的宝可梦数目多于对手，则该训练家获胜。
        <br />
        如果2位训练家余下的宝可梦数目相同，比赛结果将按余下HP的平均百份比判定，如下所述：
        <br />
        ・余下HP的平均百份比如果其中一方训练家的队伍的余下HP的平均百份比较高，则该训练家获胜，计算方法如下：
        <br />
        (余下宝可梦的目前HP)/(4只出战宝可梦的HP上限)
        <br />
        如果两位训练家的余下HP的平均百份比相同，比赛结果将按余下HP数值决定，如下所述:
        <br />
        ・余下的HP数值
        <br />
        如果其中一方训练家的隊伍余下的HP数值较高，则该训练家获胜。
        <br />
        如果2位训练家的队伍余下的HP数值相同，则该局为平局。
      </p>
      <h2 class="blue">违规宝可梦</h2>
      <p>
        4.1 违规改造宝可梦
        <br />
        禁止使用明显的非法宝可梦与道具。
        <br />
        禁止使用截至比赛当日没有正规获得途径的宝可梦以及其招式、特性、球种等。
        <br />
        禁止其他明显的修改行为。
        <br />
        一经发现视情况从当轮起本次比赛内所有场次全部判负。
        <br />
        4.2 人工检测
        <br />
        比赛开始前工作人员将会对参实者进行宝可梦检查，若发现训练家使用的宝可梦有经非正常途径入手嫌疑，将会要求更换为数据正常的宝可梦或道具进行参赛。
        <br />
        比赛期间会对训练家进行抽查，若与所填表格不符将从当轮起全部判负。
      </p>
      <h2 class="blue">关于掉线</h2>
      <p>
        如果掉线的原因为某一方故意或无意的切断电源、切到Switch的Home界面、切断无线、电量不足、携带Switch远离座位等行为，则该场对战中，发生上述行为的一方判负。
        <br />
        如果属于纯意外掉线，则该场对战不计入比赛，需要重新对战。重新对战中，可选择不同的首发、选出、指令。即，若发生纯意外的掉线后，不会进行“复盘”。
      </p>
      <ItemCard class="header" number="05" name="Battle" theme="red">比赛注意事项</ItemCard>
      <p>
        训练家参赛必须持有魔都PMO2021的门票与对战券。
        <br />
        训练家请自备正版「精灵宝可梦 剑/盾」游戏卡带或下载版软件及符合比赛规则的宝可梦，方可参赛。
        <br />
        尊重知识产权，不得以非原装正版游戏卡或各种改版下载软件作赛，违者经发现将被取消资格。
        <br />
        比赛时间以现场显示时间为准。
        <br />
        比赛后请将桌上的纸张交予比赛工作人员。
        <br />
        训练家有责任准备充足电源，比赛期间因主机电量不足而无法继续作赛者，视为弃权。<span class="red">*注6</span>
        <br />
        任何引致妨碍比赛整体运作的行为，或是妨碍魔都PMO2021活动的行为，经过工作人员判断后，有权判决生事者取消资格。
        <br />
        若有任何争议，魔都PMO组委会保留最终决定权。
      </p>
      <h2 class="red">备注内容</h2>
      <p>注1：种子训练家将通过上届魔都PMO对战区、魔都宝可梦月赛等方式决定，具体会对种子选手单独通知。</p>
      <p>注2：比赛开始前可能会有各种联络事项，请勿更改。</p>
      <p>注3：请在登记处排队前就将队伍放在对战箱内，以方便快速检查。</p>
      <p>注4：根据现场报名人数，可能会进行比赛模式的调整。</p>
      <p>
        注5：队伍重复度=训练家的六只精灵在该次比赛中总使用数的总和。
        <br />
        【例】训练家A的队伍为：武道熊师、雷吉艾勒奇、雪暴马、炽焰咆哮虎、轰擂金刚猩、败露球菇，而统计出的所有参赛训练家中，这6只精灵的使用数分别为40、50、30、100、55、55的话，那么这位训练家的队伍重复度即为40+50+30+100+55+55=330
        <br />
        另，相同编号的精灵的各种形态记为同个精灵的使用数。
      </p>
      <p>注6：会场会设置少量充电设备，可以给训练家进行充电帮助。但是数量有限，请尽可能保证充足电源或携带虫电宝。</p>
    </div>
  </HomePageBase>
</template>

<script lang="ts">
import { defineComponent } from "vue"
import HomePageBase from "../../components/HomePageBase.vue"
import ItemCard from "../../components/ItemCard.vue"

export default defineComponent({
  name: "Battle",
  components: {
    HomePageBase,
    ItemCard
  }
})
</script>

<style scoped>
.battle-info {
  font-size: 18px;
  width: 100%;
  max-width: 960px;
  display: flex;
  flex-direction: column;
  align-items: flex-start;
  padding-left: 16px;
  padding-right: 16px;
}

.battle-info > .header {
  width: unset;
  margin-top: 3em;
  margin-bottom: 1.5em;
}

.battle-info p {
  margin-top: 0.5em;
  margin-bottom: 0.5em;
}

.battle-info h2 {
  font-size: 36px;
  transform: scale(0.80, 1);
  transform-origin: left;
  margin-top: 0.5em;
  margin-bottom: 0.5em;
}
</style>